/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: asmall <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/09 11:00:50 by asmall            #+#    #+#             */
/*   Updated: 2019/10/18 17:57:54 by pthuy            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

/*
** Точка входа в программу. Сначала файл с тетрамино проходит проверку на
** валидность. Затем запускается функция создания карты и нахождения решения.
** После чего печатается карта, очищается ее структура и очищается структура
** тетрамино, созданная при проверке файла с тетрамино.
*/

int			main(int ac, char **av)
{
	t_list	*list;
	t_map	*map;

	if (ac != 2)
	{
		ft_putstr("usage: ./fillit [input_file]\n");
		return (1);
	}
	if ((list = read_tetrimino_from_file(open(av[1], O_RDONLY), 0)) == NULL)
	{
		write(1, "error\n", 6);
		return (1);
	}
	if (!(map = gen_map_and_solve(list)))
		return (1);
	map_print(map);
	map_clear(map);
	free_list(list);
	return (0);
}
